In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

#Created a new dataframe from a python dictionary
data = {
    'Name': ['John','Jane','Micheal','Emily','David'],
    
    'Math': [85, 92, 78, np.nan, 88],
    'Science':[78,45,85,91,82]
}

df = pd.DataFrame(data);

df

      Name  Math  Science
0     John  85.0       78
1     Jane  92.0       45
2  Micheal  78.0       85
3    Emily   NaN       91
4    David  88.0       82

In [4]:
#Accessing a specific column
math_column = df['Math']
science_column = df['Science']

math_column

0    85.0
1    92.0
2    78.0
3     NaN
4    88.0
Name: Math, dtype: float64

In [5]:
#filter the data 
failing_science = df[df['Science'] < 50]

failing_science

   Name  Math  Science
1  Jane  92.0       45

In [6]:
# SORT the data 
sorted_math_values = df.sort_values(by='Math',ascending=True)

sorted_math_values

      Name  Math  Science
2  Micheal  78.0       85
0     John  85.0       78
4    David  88.0       82
1     Jane  92.0       45
3    Emily   NaN       91

In [7]:
#adding new column
df['Total Score'] = df['Math'] + df['Science']

df

      Name  Math  Science  Total Score
0     John  85.0       78        163.0
1     Jane  92.0       45        137.0
2  Micheal  78.0       85        163.0
3    Emily   NaN       91          NaN
4    David  88.0       82        170.0

In [ ]:
#update data
df.loc[df['Name'] =='Emily','Math'] = '12'



df

C:\Users\arshs\AppData\Local\Temp\ipykernel_7880\1559247329.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '12' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.loc[df['Name'] =='Emily','Math'] = '12'

      Name  Math  Science  Total Score
0     John  85.0       78        163.0
1     Jane  92.0       45        137.0
2  Micheal  78.0       85        163.0
3    Emily    12       91          NaN
4    David  88.0       82        170.0

In [9]:
#Group data and calculate the mean of numeric column
grouped  = df.groupby('Math').mean(numeric_only=True)

grouped

      Science  Total Score
Math
78.0     85.0        163.0
85.0     78.0        163.0
88.0     82.0        170.0
92.0     45.0        137.0
12       91.0          NaN

In [10]:
#locating data 
micheal_science_score = df.loc[df['Name'] == 'Micheal','Science']
micheal_science_score

2    85
Name: Science, dtype: int64

In [ ]:
#locate data to next postion
third_row = df.iloc[2]
third_row